app/views/users/show.html.erb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ? ORDER BY "playlists"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---

<% @user.playlists.each do |playlist| %>

SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = ?  [["playlist_id", 1]]
---
  <ul>
    <% playlist.songs[0..9].each do |song| %>