app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @playlist = Playlist.find(params[:id])

SELECT "playlists".* FROM "playlists"
INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Queen"], ["user_id", 1], ["created_at", "2020-03-27 05:21:11.035662"], ["updated_at", "2020-03-27 05:21:11.035662"]]
---
  def create
    @playlists = Playlist.all
    @playlist = Playlist.new(playlist_params)
    if @playlist.save

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 4]]
---
  def destroy
    @playlist = Playlist.find(params[:id])
    @playlist.destroy