app/controllers/playlist_songs_controller.rb

  def index
    @playlist_songs = PlaylistSong.all.uniq(&:song_id)
---
SELECT "playlist_songs".* FROM "playlist_songs"

  def destroy
    @playlist_song = PlaylistSong.find_by(playlist_id: params[:playlist_id], song_id: params[:song_id])
    @playlist_song.destroy
---
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."playlist_id" = ? AND "playlist_songs"."song_id" = ? LIMIT ?  [["playlist_id", 2], ["song_id", 2], ["LIMIT", 1]]
DELETE FROM "playlist_songs" WHERE "playlist_songs"."id" = ?  [["id", 11]]