app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."title" = ? AND "songs"."artist" = ? AND "songs"."lyrics" = ? LIMIT ?
---
  def add_to_songs
    artist = params[:artist].titleize
    title = params[:title].titleize
    begin
      result = RestClient.get("https://api.lyrics.ovh/v1/#{artist.gsub(/\s/, "+")}/#{title.gsub(/\s/, "+")}")
    rescue RestClient::NotFound => e
      flash[:alert] = " ¯\\(◉ω◉)/¯ Song was not found. Please try a different spelling, or a different song!"
      redirect_to songs_path
    else
      resp_hash = JSON.parse(result.body)
      lyrics = resp_hash["lyrics"]
      @song = Song.find_or_create_by(title: title, artist: artist, lyrics: lyrics)