app/controllers/songs_controller.rb

  def show
    @song = Song.find(params[:id])
    if !params[:playlist_id].blank?
      @playlist = Playlist.find(params[:playlist_id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @song = Song.find(params[:id])
    @song.update(song_params)
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "songs" SET "video_url" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["video_url", "https://www.youtube.com/watch?v=wXhTHyIgQ_U"], ["updated_at", "2020-03-26 18:47:21.583508"], ["id", 10]]

  def add_to_playlist
    artist = params[:artist].titleize
    title = params[:title].titleize
    begin
      result = RestClient.get("https://api.lyrics.ovh/v1/#{artist.gsub(/\s/, "+")}/#{title.gsub(/\s/, "+")}")
    rescue RestClient::NotFound => e
      flash[:alert] = " ¯\\(◉_◉)/¯ Song was not found. Please try a different spelling, or a different song!"
      redirect_to playlist_path(params[:playlist_id])
    else
      resp_hash = JSON.parse(result.body)
      lyrics = resp_hash["lyrics"]
      if !Song.find_by(title: title, artist: artist)
        @song = Song.create(title: title, artist: artist, lyrics: lyrics)
        @playlist_song = PlaylistSong.create(playlist_id: params[:playlist_id], song_id: @song.id)
        flash[:notice] = "(>ﾟヮﾟ)> Song has been added! <(ﾟヮﾟ<)"
        redirect_to request.referrer
      else
        @song = Song.find_by(title: title, artist: artist)
        if !PlaylistSong.find_by(playlist_id: params[:playlist_id], song_id: @song.id)
          @playlist_song = PlaylistSong.create(playlist_id: params[:playlist_id], song_id: @song.id)
---
SELECT "songs".* FROM "songs" WHERE "songs"."title" = ? AND "songs"."artist" = ? LIMIT ?  [["title", "Somebody Else"], ["artist", "The 1975"], ["LIMIT", 1]]
INSERT INTO "songs" ("title", "artist", "lyrics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "playlist_songs" ("playlist_id", "song_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["playlist_id", 2], ["song_id", 5], ["created_at", "2020-03-25 22:15:23.616203"], ["updated_at", "2020-03-25 22:15:23.616203"]]
SELECT "songs".* FROM "songs" WHERE "songs"."title" = ? AND "songs"."artist" = ? LIMIT ?  [["title", "Somebody To Love"], ["artist", "Queen"], ["LIMIT", 1]]
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."playlist_id" = ? AND "playlist_songs"."song_id" = ? LIMIT ?  [["playlist_id", 5], ["song_id", 16], ["LIMIT", 1]]
INSERT INTO "playlist_songs" ("playlist_id", "song_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["playlist_id", 5], ["song_id", 16], ["created_at", "2020-03-27 17:49:55.238455"], ["updated_at", "2020-03-27 17:49:55.238455"]]

  def add_to_songs
    artist = params[:artist].titleize
    title = params[:title].titleize
    begin
      result = RestClient.get("https://api.lyrics.ovh/v1/#{artist.gsub(/\s/, "+")}/#{title.gsub(/\s/, "+")}")
    rescue RestClient::NotFound => e
      flash[:alert] = " ¯\\(◉_◉)/¯ Song was not found. Please try a different spelling, or a different song!"
      redirect_to songs_path
    else
      resp_hash = JSON.parse(result.body)
      lyrics = resp_hash["lyrics"]
      if !Song.find_by(title: title, artist: artist)
        @song = Song.create(title: title, artist: artist, lyrics: lyrics)
---
SELECT "songs".* FROM "songs" WHERE "songs"."title" = ? AND "songs"."artist" = ? LIMIT ?  [["title", "When You Were Young"], ["artist", "The Killers"], ["LIMIT", 1]]
INSERT INTO "songs" ("title", "artist", "lyrics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def sort_artist
    @songs = Song.all.sort_by(&:artist)
---
SELECT "songs".* FROM "songs"

  def sort_title
    @songs = Song.all.sort_by(&:title)
---
SELECT "songs".* FROM "songs"