app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Erock"], ["created_at", "2020-03-25 01:14:17.284068"], ["updated_at", "2020-03-25 01:14:17.284068"]]