app/views/playlists/index.html.erb


  <%= f.collection_select :user_id, User.all, :id, :username %>
---
SELECT "users".* FROM "users"

    <h4><%= link_to "#{playlist.name}", playlist_path(playlist) %></h4>
      <% playlist.songs[0..2].each do |song| %>
---
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = ?  [["playlist_id", 1]]