app/views/playlists/new.html.erb


  <%= f.collection_select :user_id, User.all, :id, :username %>
---
SELECT "users".* FROM "users"