app/views/playlists/show.html.erb

SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = ?  [["playlist_id", 1]]
---

<% @playlist.songs.each do |song| %>